app/Controllers/Buku.php

    public function index()
{
    $model = new BukuModel();
    $keyword = $this->request->getGet('keyword');

    if ($keyword) {
        $buku = $model->like('judul', $keyword)->findAll();
    } else {
        $buku = $model->findAll();
---
SELECT *
FROM `buku`
WHERE `judul` LIKE '%pula%' ESCAPE '!'
SELECT *
FROM `buku`

    public function store()
    {
        $model = new BukuModel();
        $model->insert([
            'judul' => $this->request->getPost('judul'),
            'pengarang' => $this->request->getPost('pengarang'),
            'penerbit' => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);
---
INSERT INTO `buku` (`judul`, `pengarang`, `penerbit`, `tahun_terbit`) VALUES ('Laut Bercerita', 'Leila S. Chudori', 'Gramedia', '2017')

    public function edit($id)
    {
        $model = new BukuModel();
        $data['buku'] = $model->find($id);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '3'

    public function delete($id)
    {
        $model = new BukuModel();
        $model->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('4')